{"summaries":[{"The Joe Rogan Experience":"The podcast of Comedian Joe Rogan"},
{"The RFK Tapes":"When Robert F. Kennedy was assassinated in 1968, a lone gunman was captured at the scene, revolver in hand. It seemed like an open and shut case. So why did the police keep evidence hidden away for decades? Over ten episodes, hosts Zac Stuart-Pontier (Crimetown) and Bill Klaber (author, Shadow Play) comb through previously secret police tapes and track down the people who were there to investigate troubling questions about one of the most significant crimes in American history."},
{"Oprah’s SuperSoul Conversations":"Awaken, discover and connect to the deeper meaning of the world around you with SuperSoul. Hear Oprah’s personal selection of her interviews with thought-leaders, best-selling authors, spiritual luminaries, as well as health and wellness experts. All designed to light you up, guide you through life’s big questions and help bring you one step closer to your best self."},
{"Revisionist History":"Revisionist History is Malcolm Gladwell's journey through the overlooked and the misunderstood. Every episode re-examines something from the past—an event, a person, an idea, even a song—and asks whether we got it right the first time. From Panoply Media. Because sometimes the past deserves a second chance."},
{"American Fiasco":"Join host Roger Bennett of Men in Blazers for this story of the U.S. men's soccer team that swaggered onto the international stage and set out to win the 1998 World Cup in France. When they arrived, they faced only one serious opponent: themselves. WNYC Studios is a listener-supported producer of other leading podcasts including Freakonomics Radio, Death, Sex & Money, On the Media and many more."},
{"Puty's World Cup Podcast":"The greatest podcast Barstool has ever produced discussing the greatest sporting extravaganza the world will ever see this year: Puty's World Cup Podcast."},
{"The Daily":"This is what the news should sound like. The biggest stories of our time, told by the best journalists in the world. Hosted by Michael Barbaro. Twenty minutes a day, five days a week, ready by 6 a.m."},
{"This American Life":"Serial is a podcast from the creators of This American Life, hosted by Sarah Koenig. Serial unfolds one story - a true story - over the course of a whole season. The show follows the plot and characters wherever they lead, through many surprising twists and turns. Sarah won't know what happens at the end of the story until she gets there, not long before you get there with her. Each week she'll bring you the latest chapter, so it's important to listen in, starting with Episode 1. New episodes are released on Thursday mornings."},
{"Stuff You Should Know":"If you've ever wanted to know about champagne, satanism, the Stonewall Uprising, chaos theory, LSD, El Nino, true crime and Rosa Parks then look no further. Josh and Chuck have you covered."},
{"Cover-Up":"A presidential hopeful crashes his car in the middle of the night and leaves a young woman to die. What transpired in the hours after Ted Kennedy’s car went over the bridge in Chappaquiddick changed the course of American history. Nearly 50 years later, everyone has a theory yet no one knows the truth. Follow the investigation and hear from those who lived through it in this series from People magazine and Cadence13."},
{"My Favorite Murder with Karen Kilgariff and Georgia Hardstark":"Lifelong fans of true crime stories Karen Kilgariff and Georgia Hardstark tell each other their favorite tales of murder and hear hometown crime stories from friends and fans."},
{"Serial":"Serial is a podcast from the creators of This American Life, hosted by Sarah Koenig. Serial unfolds one story - a true story - over the course of a whole season. The show follows the plot and characters wherever they lead, through many surprising twists and turns. Sarah won't know what happens at the end of the story until she gets there, not long before you get there with her. Each week she'll bring you the latest chapter, so it's important to listen in, starting with Episode 1. New episodes are released on Thursday mornings."},
{"Hidden Brain":"Shankar Vedantam uses science and storytelling to reveal the unconscious patterns that drive human behavior, shape our choices and direct our relationships."},
{"Armchair Expert with Dax Shepard":"Hi, I’m Dax Shepard, and I love talking to people. I am endlessly fascinated by the messiness of being human, and I find people who are vulnerable and honest about their struggles and shortcomings to be incredibly sexy. I invite you to join me as I explore other people’s stories. We will celebrate, above all, the challenges and setbacks that ultimately lead to growth and betterment. What qualifies me for such an endeavor? More than a decade of sobriety, a degree in Anthropology and four years of improv training. I will attempt to discover human “truths” without any laboratory work, clinical trials or data collection. I will be, in the great tradition of 16th-century scientists, an Armchair Expert."},
{"TED Radio Hour":"Guy Raz explores the emotions, insights, and discoveries that make us human. The TED Radio Hour is a narrative journey through fascinating ideas, astonishing inventions, fresh approaches to old problems, and new ways to think and create."},
{"How I Built This with Guy Raz":"Guy Raz dives into the stories behind some of the world's best known companies. How I Built This weaves a narrative journey about innovators, entrepreneurs and idealists—and the movements they built."},
{"Binge Mode: Harry Potter":"Jump on your broom and join The Ringer’s Mallory Rubin and Jason Concepcion as they take their signature deep dive into 'Harry Potter,' covering all the books and movies as well as the extended 'Potter' universe."},
{"In the Dark":"Reporter Madeleine Baran examines the case of Curtis Flowers, who has been tried six times for the same crime. For 21 years, Flowers has maintained his innocence. He's won appeal after appeal, but every time, the prosecutor just tries the case again. In the Dark is an investigative podcast from APM Reports. Season One focused on the abduction of Jacob Wetterling."},
{"S-Town":"S-Town is a new podcast from Serial and This American Life, hosted by Brian Reed, about a man named John who despises his Alabama town and decides to do something about it. He asks Brian to investigate the son of a wealthy family who's allegedly been bragging that he got away with murder. But when someone else ends up dead, the search for the truth leads to a nasty feud, a hunt for hidden treasure, and an unearthing of the mysteries of one man's life."},
{"Kickass News":"Hosted by Hollywood producer and political media strategist Ben Mathis, KickAss News is a twice weekly podcast that features the most interesting personalities and thought leaders in politics, entertainment, tech, business, science, and more. Enjoy the podcast?  Then please support the show and help keep us on the air by making a donation to our GoFundMe campaign at www.gofundme.com/kickassnews. Another way you can support the show is to subscribe to the podcast and leave us a review on iTunes to help keep us ranking strong on the top podcasts charts.  For more information visit www.kickassnews.com.  Thanks for listening!"},
{"15 Minutes to Freedom:  A Warrior’s Daily Focus on Journals and Meditations":"15 Minutes to Freedom is an unfiltered daily dive into the mind of a Warrior. Using his morning meditations and personal journal as a guide, Ryan puts his experiences in perspective to help you expand your own life. Topics range from the importance of telling the truth, how to find light in the darkness, tapping into your own spirituality, and much more. The sole purpose of this daily show is to offer relatable guidance, provide information, and inspire you to re-align and take action!"},
{"Freakonomics Radio":"Have fun discovering the hidden side of everything with host Stephen J. Dubner, co-author of the best-selling Freakonomics” books. Each week, hear surprising conversations that explore the riddles of everyday life and the weird wrinkles of human nature—from cheating and crime to parenting and sports. Dubner talks with Nobel laureates and provocateurs, social scientists and entrepreneurs — and his “Freakonomics” co-author Steve Levitt. After just a few episodes, this podcast will have you too thinking like a Freak. Produced by WNYC Studios, home of other great podcasts such as  Radiolab, Death, Sex & Money, and On the Media."},
{"The Ben Shapiro Show":"Tired of the lies? Tired of the spin? Are you ready to hear the hard-hitting truth in comprehensive, conservative, principled fashion? The Ben Shapiro Show brings you all the news you need to know in the most fast moving daily program in America. Ben brutally breaks down the culture and never gives an inch! Monday thru Friday"},
{"Caliphate":"In the war on terror, who is it that we’re really fighting? “Caliphate” follows Rukmini Callimachi, who covers terrorism for The New York Times, on her quest to understand ISIS. New York Times subscribers can listen to new episodes early at nytimes.com/caliphate. This series includes disturbing language and scenes of graphic violence. Producer: Andy Mills; Reporters: Rukmini Callimachi and Andy Mills; Managing Producer: Larissa Anderson; Editors: Wendy Dorr and Larissa Anderson; Associate Producer: Asthaa Chaturvedi; Technical Director: Brad Fisher; Executive Producer, NYT Audio: Lisa Tobin; Editorial Director, NYT Audio: Samantha Henig; Assistant Managing Editor, NYT: Sam Dolnick; Music: William Brittelle, Andy Mills, Nate Henricks, Cliff Martinez, Brad Fisher, Taku Sugimoto and David Wingo"},
{"The Dave Ramsey Show":"The Dave Ramsey Show is about real life and how it revolves around money. Dave Ramsey teaches you to manage and budget your money, get out of debt, build wealth, and live in financial peace. Managing your money properly will reduce stress, improve your marriage, and provide security for you and your family. Updated: Tue, 18 Aug 2015"},
{"TED Talks Daily":"Want TED Talks on the go? Every weekday, this feed brings you our latest talks in audio format. Hear thought-provoking ideas on every subject imaginable -- from Artificial Intelligence to Zoology, and everything in between -- given by the world's leading thinkers and doers. This collection of talks, given at TED and TEDx conferences around the globe, is also available in video format."},
{"Up and Vanished":"Up and Vanished is an investigative podcast that explores the unsolved disappearance of Georgia beauty queen and high school teacher, Tara Grinstead. The 11-year-old cold case is the largest case file in the history of Georgia. Follow along as host Payne Lindsey, a filmmaker turned amateur investigator, examines old case evidence and re-interviews persons of interest. What happened to Tara Grinstead?"},
{"Up First":"NPR's Up First is the news you need to start your day. The biggest stories and ideas — from politics to pop culture — in 10 minutes. Hosted by Rachel Martin, David Greene and Steve Inskeep, with reporting and analysis from NPR News. Available weekdays by 6 a.m. ET. Subscribe and listen, then support your local NPR station at donate.npr.org."},
{"Dirty John":"Debra Newell is a successful interior designer. She meets John Meehan, a handsome man who seems to check all the boxes: attentive, available, just back from a year in Iraq with Doctors Without Borders. But her family doesn’t like John, and they get entangled in an increasingly complex web of love, deception, forgiveness, denial, and ultimately, survival. Reported and hosted by Christopher Goffard from the L.A. Times."},
{"Something You Should Know":"Sometimes all it takes is one little fact or one little piece of wisdom to change your life forever. That's the purpose and the hope of Something You Should Know. In each episode, host Mike Carruthers interviews top experts in their field to bring you fascinating information and advice to help you save time and money, advance in your career, become wealthy, improve your relationships and help you simply get more out of life. In addition, Mike uncovers and shares short, engaging pieces of intel you can use to make your life better - today. Right now."},
{"Planet Money":"The economy explained. Imagine you could call up a friend and say, Meet me at the bar and tell me what's going on with the economy. Now imagine that's actually a fun evening."},
{"Fresh Air":"Fresh Air from WHYY, the Peabody Award-winning weekday magazine of contemporary arts and issues, is one of public radio's most popular programs. Hosted by Terry Gross, the show features intimate conversations with today's biggest luminaries."},
{"PD Stories":"Law enforcement professionals join host Tom Morris Jr. (America’s Most Wanted, Live PD) to share their experiences, insights and perspective on policing."},
{"Lore":"Lore is a bi-weekly podcast (and upcoming TV show) about the dark historical tales that fuel our modern superstitions. Each episode explores the world of mysterious creatures, tragic events, and unusual places.Because sometimes the truth is more frightening than fiction."},
{"Radiolab":"A two-time Peabody Award-winner, Radiolab is an investigation told through sounds and stories, and centered around one big idea. In the Radiolab world, information sounds like music and science and culture collide. Hosted by Jad Abumrad and Robert Krulwich, the show is designed for listeners who demand skepticism, but appreciate wonder. WNYC Studios is the producer of other leading podcasts including Freakonomics Radio, Death, Sex & Money, On the Media and many more."},
{"Wait Wait... Don't Tell Me!":"NPR's weekly current events quiz. Have a laugh and test your news knowledge while figuring out what's real and what we've made up."},
{"Dan Carlin's Hardcore History":"In Hardcore History journalist and broadcaster Dan Carlin takes his Martian , unorthodox way of thinking and applies it to the past. Was Alexander the Great as bad a person as Adolf Hitler? What would Apaches with modern weapons be like? Will our modern civilization ever fall like civilizations from past eras? This isn't academic history (and Carlin isn't a historian) but the podcast's unique blend of high drama, masterful narration and Twilight Zone-style twists has entertained millions of listeners."},
{"Nobody Told Me!":"Sure, everyone wants to talk about their successes, but how did they get there? What do inspirational people wish they had been told when they were starting out? Nobody Told Me! is a two-generational podcast hosted by legendary broadcaster, Jan Black, and her millennial daughter, Laura Owens.  Together, they ask questions to learn what made these people into the motivational figures they are today.  And how you can be one yourself."},
{"The Wonderland Murders by Hollywood & Crime":"Journey back to 1981, when four people were brutally murdered in their home in the Hollywood Hills. The Wonderland Murders is the tale of a violent home invasion robbery and the revenge rampage that followed. It involves a drug-fueled gang of criminals, a crazed crime kingpin -- and the world’s most famous porn star on a downward and deadly spiral. Join Young Charlie host Tracy Pattin and writer/director Larry Brand and they take you back to Wonderland Ave."},
{"Great Women of Business":"The wage gap. The motherhood penalty. The glass ceiling. The stories of business savvy women who battled sexism all the way to the executive suite are both thought provoking and inspiring. From Coco Chanel to Mrs. Fields, Julia Child to Martha Stewart, every Tuesday we present the triumphs of individuals ahead of their time. Through their stories, we examine their most innovative business principles and how those shaped their work and lives. Great Women of Business is part of the Parcast Network."},
{"Pod Save America":"Four former aides to President Obama — Jon Favreau, Dan Pfeiffer, Jon Lovett, and Tommy Vietor — are joined by journalists, politicians, comedians, and activists for a freewheeling conversation about politics, the press and the challenges posed by the Trump presidency."},
{"Sword and Scale":"The Sword and Scale true-crime podcast is an immersive audio experience covering the underworld of criminal activity and the demented minds that perform the most despicable and unthinkable actions, proving that the worst monsters are very real.  We cover true-crime stories, high-profile trials, unsolved murders and missing persons cases."},
{"Duolingo Spanish Podcast":"True stories for English speakers learning Spanish. From the makers of Duolingo, the most popular language-learning app, comes a new podcast that delivers fascinating real-life stories  in easy-to-understand Spanish with English narration. These are not language lessons; they’re life lessons through language. Hosted by Martina Castro, co-founder of NPR’s Radio Ambulante."},
{"The Jordan B. Peterson Podcast":"This podcast is a collection of interviews & lectures, some of which are recorded specifically for this podcast, and some that are from his university courses, public lectures, documentary interviews, and YouTube videos from his channel: Jordan Peterson Videos (https://www.youtube.com/user/JordanPetersonVideos). The podcast offers discussion and information concerning a variety of complex ideas: How moral & pragmatic values regulate emotion and motivation; Psychometric models such as the Big Five; The significance of hero mythology; The meaning of music, and the structure of the world as represented through religion and spiritual belief."},
{"Stuff You Missed in History Class":"Join Holly and Tracy as they bring you the greatest and strangest Stuff You Missed In History Class in this podcast by HowStuffWorks.com."},
{"High Noon":"Bomani Jones and Pablo Torre discuss the hottest topics of the day with their own unique spin."},
{"Entrepreneur Stories 4⃣ Inspiration: Millionaire Interviews":"Inspiring Stories to Help Motivate, Build, & Grow Your Successful Business...Millionaire Interviews is actionable advice for the (future & present) Entrepreneur, Solopreneur, and Small Business Owner.  The host interviews Business Founders in the Product, Service, Real Estate, and Tech industries so they can teach you from their experience.  Guests have been featured on Forbes, Shark Tank, Fox Business, CNBC, & Time Magazine. Each episode details the journey of our guest who shares their life experiences, business lessons learned, how they turned their ideas into success, and much more. Inspired by: Tim Ferriss, Dave Ramsey, Garyvee, Tony Robbins, Mark Cuban, Lewis Howes, Jocko, Pat Flynn, Neil Patel, NPR, Joe Rogan, Y Combinator, Passive Income, Real Estate, B2B, B2C, & Business Startups...Connect with other Listeners @ fb.com/millionaire-interviews.  Connect with the Show via email: austin@millionaire-interviews.com or voicemail: +1 (305) 985-3469."},
{"Brown Chicken Brown Cow Podcast":"Welcome to The Brown Chicken Brown Cow Show & Podcast. We are a Sex-Body-Gender Positive podcast and show that aims to entertain, inform, and have a little fun. There’s going to be something here for everyone who believes that sexual exploration, sexual communication, sexual identities, and being open to sexual possibilities are healthy, friendly, and most importantly fun. We believe that your things might not be our things but your things are ok too. Join your hosts as we all learn and share more about this sexy world around us. Want to know how you can help us out and to reach our show goals? Maybe you can support the show, get stuff, and even be part of the party? Head on over to our Patreon.com/bcbcpodcast page and become a monthly subscriber. There are so many levels of support it is insane. Pick the level you want and become part of the magic. If we reach our goals we will start producing more podcasts, more live shows, and more stuff and prizes for you."},
{"VIEWS with David Dobrik and Jason Nash":"In this weekly podcast, David Dobrik, a 21-year-old, sexy, millionaire YouTuber and Jason Nash, a 40-something single dad with a vlog of his own, take you behind-the-scenes of their vlogs and show you what living the “YouTube life” is really like. Join these two as they confess their most intimate thoughts, discuss pop-culture, and dissect their own contentious relationship. New episodes drop every Thursday!"},
{"Last Podcast On The Left":"The Last Podcast On The Left covers all the horrors our world has to offer both imagined and real, from demons and slashers to cults and serial killers, The Last Podcast is guaranteed to satisfy your blood lust."},
{"The Bill Simmons Podcast":"HBO and The Ringer's Bill Simmons hosts the most downloaded sports podcast of all time, with a rotating crew of celebrities, athletes, and media staples, as well as mainstays like Cousin Sal, Joe House, and a slew of other friends and family members who always happen to be suspiciously available."},
{"The Tim Ferriss Show":"Tim Ferriss is a self-experimenter and bestselling author, best known for The 4-Hour Workweek, which has been translated into 40+ languages.  Newsweek calls him \"the world's best human guinea pig,\" and The New York Times calls him \"a cross between Jack Welch and a Buddhist monk.\"  In this show, he deconstructs world-class performers from eclectic areas (investing, chess, pro sports, etc.), digging deep to find the tools, tactics, and tricks that listeners can use."},
{"The Moth":"Since its launch in 1997, The Moth has presented thousands of true stories, told live and without notes, to standing-room-only crowds worldwide. Moth storytellers stand alone, under a spotlight, with only a microphone and a roomful of strangers. The storyteller and the audience embark on a high-wire act of shared experience which is both terrifying and exhilarating. Since 2008, The Moth podcast has featured many of our favorite stories told live on Moth stages around the country. For information on all of our programs and live events, visit themoth.org."},
{"Casefile True Crime":"Fact is scarier than fiction."},
{"New Mindset, Who Dis?":"Hi, I’m Case Kenny (@case.kenny on Instagram) and I firmly believe that the world belongs to those with perspective. Perspective doesn’t come from the latest curated headline online, or the latest self help guru. It comes from weirdos. Nerds. Misfits. Odd balls. Eccentric, future CEOs. jetsetting artists and musicians… people who chase purpose and understand that they are always one decision away from a totally different life. I’m fascinated by human potential and the mindsets that allow us to reach our own. I’ve been fortunate to find my passion in life and I find fulfillment with it each day. I want to help you do the same. Join me on my weekly podcast “New Mindset, Who Dis?.” It’s a different kind of podcast... no gurus, no fluff and no preaching of generic life advice… just short but real and relatable conversations on self-help, wellness, and mindsets with practical and personal insights into how to live a passionate, purposeful and happy life. Short, weekly episodes that are less than 20 minutes in length on how to live the life you’re meant for that will leave you thinking to yourself… “new mindset, who dis?” and other people thinking… “wow you’ve changed”."},
{"Pardon My Take":"On \"Pardon My Take,\" Big Cat & PFT Commenter deliver the loudest and most correct sports takes in the history of the spoken word. Daily topics, guests, and an inability to tell what the hosts might be doing will make this your new favorite sports talk show. This is a podcast that will without a doubt change your life for the better- guaranteed, or your money back. *Pretend a reggaeton air horn is going off right now*"},
{"Criminal":"Criminal is a podcast about crime. Not so much the \"if it bleeds, it leads,\" kind of crime. Something a little more complex. Stories of people who've done wrong, been wronged, and/or gotten caught somewhere in the middle. We're a proud member of Radiotopia, from PRX, a curated network of extraordinary, story-driven shows. Learn more at radiotopia.fm."},
{"Shane And Friends":"I'm Shane Dawson and I have a lot of friends. Most of them are in my head. Listen as me and my producer Lauren Schnipper talk about stuff we think is funny and interview people we hope are funny. Also I like to do character voices and celebrity impressions but I promise, it's not as annoying as it sounds."},
{"Invisibilia":"Unseeable forces control human behavior and shape our ideas, beliefs, and assumptions. Invisibilia—Latin for invisible things—fuses narrative storytelling with science that will make you see your own life differently."},
{"30 For 30 Podcasts":"Original audio documentaries and more from the makers of the acclaimed 30 for 30 series. We make new documentary seasons each spring and fall, and highlight conversations about the 30 for 30 films in between. Sports stories like you've never heard before. Season three, a five-part series about the complicated world of Bikram yoga and its guru BIkram Choudhary, is out now."},
{"Someone Knows Something":"Host David Ridgen joins victims’ family members as they investigate cold cases, tracking down leads, speaking to suspects and searching for answers. S1: Adrien McNaughton. S2: Sheryl Sheppard. S3: Dee & Moore. S4: Wayne Greavette."},
{"The Tony Robbins Podcast":"Why live an ordinary life, when you can live an extraordinary one?” Tony Robbins, the #1 Life and Business Strategist, has helped over 50 million people from 100 countries create real and lasting change in their lives. In this podcast, he shares proven strategies and tactics so you, too, can achieve massive results in your business, relationships, health and finances. In addition to excerpts from his signature events and other exclusive, never-before-released audio content, Tony and his team also conduct deeply insightful interviews with the most prominent masterminds and experts on the global stage."},
{"Monday Morning Podcast":"Bill Burr rants about relationship advice, sports and the Illuminati."},
{"The Breakfast Club":"The World's Most Dangerous Morning Show, The Breakfast Club, With DJ Envy, Angela Yee And Charlamagne Tha God!"},
{"The Trevor Chapman Show":"The Trevor Chapman Show is a celebration of the human experience. Trevor seeks out the most interesting, high-achieving, and engaging human beings on the planet to discuss everything from entrepreneurship, to performance, to happiness; essentially the pursuit of the good life in all areas. Trevor Chapman has been recognized by top publications including Forbes, Entrepreneur, and CNBC as being one of the Top 1% Digital Strategists. He has been an entrepreneur for 14 years and has generated over $100 Million in his companies."},
{"David Schuman: Success For Life Podcast":"hosted by successful entrepreneur and coach, David Schuman, founder and CEO of NUC Sports & NUC Media, David breaks down the thought leaders in various industries and what has made them successful. We discuss motivation, coaching, business development, development and personal habits that have helped our guest become successful."},
{"Bubble":"Welcome to Fairhaven, a literal Bubble of corporate utopia set amid the wild, goblin-infested Brush. The first scripted comedy series from Maximum Fun, Bubble tells a tale that is both contemporary and otherworldly, as a small band of monster killers struggles to make ends meet and find love in a nightmarish version of the gig economy. Starring: Alison Becker (Parks and Recreation), Keith Powell (30 Rock), Cristela Alonzo (Cristela), Eliza Skinner (The Late Late Show) and Mike Mitchell (Love), with appearances by Judy Greer, John Hodgman, Martin Starr, Paul F. Tompkins, and many, many more."},
{"NPR Politics Podcast":"The NPR Politics Podcast is where NPR's political reporters talk to you like they talk to each other. With weekly roundups and quick takes on news of the day, you don't have to keep up with politics to know what's happening. You just have to keep up with us."},
{"Unsolved Murders: True Crime Stories":"Unsolved Murders: True Crime Stories is a podcast drama with a modern twist on old time radio that delves into the mystery of true cold cases and unsolved murders. With the help of an ensemble cast, follow our hosts as they take you on an entertaining journey through the crime scene, the investigation and attempt to solve the case. With many surprising plot twists, it’s important you start listening from the first episode of a cold case. New episodes are released every Tuesday. Unsolved Murders: True Crime Stories is part of the Parcast Network and is a Cutler Media Production."},
{"Business & Biceps":"Business & Biceps is a podcast for entrepreneurs and those who aspire to be better. It is not for the faint of heart. Though you may not always like what you hear, it is the truth. We provide direct, off the cuff advice and life stories that will benefit anyone looking to become better at what they do. Hosted by three serial entrepreneurs who have experienced incredible highs and brutal lows, Maurice Clarett, Cory Gregory & John Fosco. We take you through the process of identifying and applying the building blocks of what it takes become a better and more effective person. Business & Biceps is a podcast that stands out from the crowd."},
{"99% Invisible":"Design is everywhere in our lives, perhaps most importantly in the places where we've just stopped noticing. 99% Invisible is a weekly exploration of the process and power of design and architecture. From award winning producer Roman Mars. Learn more at 99percentinvisible.org.\nA proud member of Radiotopia, from PRX. Learn more at radiotopia.fm."},
{"Your Art Sucks":"Regardless of where you are in your creative career, the hard truth is that your art is not where it should be. Whether you have chosen to a write, paint, act, make films or music, you know your talent needs to be further honed. This podcast is here to help. Each episode will examine the methods legendary artists, from all fields, have used to push themselves, and their art, out of mediocrity. We will strip away fact from fiction and reveal actionable truths that you can immediately apply to your creative processes. And, as we go down this path, we will make art that doesn't suck"},
{"WTF with Marc Maron Podcast":"Comedian Marc Maron is tackling the most complex philosophical question of our day - WTF? He'll get to the bottom of it with help from comedian friends, celebrity guests and the voices in his own head."},
{"The Tone Vays Podcast":"https://itunes.apple.com/us/podcast/the-tone-vays-podcast/id1390209454?mt=2"},
{"The GaryVee Audio Experience":"Welcome to The Garyvee Audio Experience, hosted by entrepreneur, CEO, investor, vlogger, and public speaker Gary Vaynerchuk. On this podcast you'll find a mix of my #AskGaryVee show episodes, keynote speeches on marketing and business, segments from my DAILYVEE video series, interviews and fireside chats I've given, as well as new and current thoughts I record originally for this audio experience!"},
{"Atlanta Monster":"From the producers of Up and Vanished and HowStuffWorks, Atlanta Monster aims to tell the true story of one of Atlanta’s darkest secrets, almost 40 years later."},
{"Men In Blazers":"We discuss football. And wear blazers. Usually at the same time. Men in Blazers is driven by the belief that Soccer is America’s Sport of the Future. As it has been since 1972."},
{"Covert":"Covert takes listeners on a heart-pounding journey through the most dangerous military operations of all time. From the assassination of Osama Bin Laden and how two Israeli snipers foiled Syria’s plan to develop a nuclear bomb, to the real story that inspired the movie Black Hawk Down and the harrowing tale of a British Major’s escape from 2,000 heavily armed militants, you'll be brought to the front line of history’s greatest special forces missions."},
{"Waking Up with Sam Harris":"Join neuroscientist, philosopher, and best-selling author Sam Harris as he explores important and controversial questions about the human mind, society, and current events. \n\nSam Harris is the author of five New York Times bestsellers. His books include The End of Faith, Letter to a Christian Nation, The Moral Landscape, Free Will, Lying, Waking Up, and Islam and the Future of Tolerance (with Maajid Nawaz). The End of Faith won the 2005 PEN Award for Nonfiction. His writing and public lectures cover a wide range of topics—neuroscience, moral philosophy, religion, meditation practice, human violence, rationality—but generally focus on how a growing understanding of ourselves and the world is changing our sense of how we should live. \n\nHarris's work has been published in more than 20 languages and has been discussed in The New York Times, Time, Scientific American, Nature, Newsweek, Rolling Stone, and many other journals. He has written for The New York Times, The Los Angeles Times, The Economist, The Times (London), The Boston Globe, The Atlantic, The Annals of Neurology, and elsewhere.\n\nSam Harris received a degree in philosophy from Stanford University and a Ph.D. in neuroscience from UCLA."},
{"On Being with Krista Tippett":"Groundbreaking Peabody Award-winning conversation about the big questions of meaning — spiritual inquiry, science, social healing, and the arts. Each week a new discovery about the immensity of our lives. Hosted by Krista Tippett, new every Thursday."},
{"BIG MONEY STYLIST":"Danielle K White, owner of DKW Styling and creator of Natural Beaded Rows (NBR) had a vision as a hair stylist to bring value and purpose to others through hair extensions, taking this industry to an even greater level with Lead Stylists Valerie Plunk and Anianne Rivera, merging their elite skills as Artists with the business aspect of being a Salon Owner with Danielle’s husband, Garrett J White, founder of Wake Up Warrior and co-owner of DKW Styling."},
{"Magazeti":"Listen to Magazeti - Africa's First Podcasting Network. With Multiple Podcast shows like Being Male, Sports weekly, Today’s woman, M-Power, Entertainment Weekly to name a few. Magazeti is the premier Podcast in Africa. Download these free podcasts and listen to your favourite shows on the podcast app of your choice."},
{"Slow Burn: A Podcast About Watergate":"You think you know the story, or maybe you don’t. But Watergate was stranger, wilder, and more exciting than you can imagine. What did it feel like to live through the scandal that brought down President Nixon? Find out on this eight-episode podcast miniseries hosted by Leon Neyfakh.\n\nThis podcast is made possible by Slate Plus members, who get a full-length bonus episode every week. Find out more at http://slate.com/slowburn."},
{"The Science of Happiness":"Learn research-tested strategies for a happier, more meaningful life, drawing on the science of compassion, gratitude, mindfulness, and awe. Hosted by award-winning professor Dacher Keltner. Co-produced by PRI and UC Berkeley's Greater Good Science Center."},
{"WorkLife with Adam Grant":"You spend a quarter of your life at work, so shouldn’t you enjoy it? Organizational psychologist Adam Grant takes you inside some of the world’s most unusual workplaces to discover the keys to better work. Whether you’re learning how to love criticism or trust a co-worker you can’t stand, one thing’s for sure: You’ll never see your job the same way again."},
{"Obscure with Michael Ian Black":"Comedian Michael Ian Black is tackling a great work of literature. Actually, Tackling might be too strong a word. More like “light caressing” plus a lot of complaining. He's reading the Thomas Hardy classic, Jude the Obscure, out loud and commenting as he goes. Join Michael, some of his famous (and non-famous) friends and experts as he discovers Jude’s world and a few things about his own. Is it a terrible idea? Probably. But it’s a terrible idea he wants to do with you."},
{"Where Should We Begin? with Esther Perel":"Step into iconic relationship therapist Esther Perel’s office and listen as 10 anonymous couples in search of insight bare the raw, intimate, and profound details of their story. From infidelity, to sexlessness, to loss, it’s a space for people to be heard and understood. It’s also a place for us to listen and feel empowered in our own relationships. So.. where should we begin? New episode every Friday, starting Oct. 20th. Season 2 drops on Audible Oct. 24th."},
{"Dear Sugars":"The universe has good news for the lost, lonely and heartsick. The Sugars are here, speaking straight into your ears. Hosted by the original Sugars, Cheryl Strayed and Steve Almond, the podcast fields all your questions — no matter how deep or dark — and offers radical empathy in return. Send your letters to dearsugars@nytimes.com."},
{"Under The Skin with Russell Brand":"My new podcast 'Under The Skin' asks: what's beneath the surface - of people we admire, of the ideas that define our time, of the history we are told. Speaking with guests from the world of academia, popular culture and the arts, they'll help us to see the ulterior truth behind our constructed reality. And have a laugh."},
{"Her Money Matters: Money Talk For Women | Financial Education | Budgeting":"Jen Hemphill, Motivational Money Coach goes on a money journey each week with you helping you make your money simple and easy to master.  She brings to you practical and simple money insights and showcases women like you to share their real life stories.  Grab the Jumpstart Your Budget Mini-Guide that gives you a simple place to start and finally limit the overwhelm you experience with your finances at www.jenhemphill.com."},
{"Jocko Podcast":"My new podcast 'Under The Skin' asks: what's beneath the surface - of people we admire, of the ideas that define our time, of the history we are told. Speaking with guests from the world of academia, popular culture and the arts, they'll help us to see the ulterior truth behind our constructed reality. And have a laugh."},
{"Still Processing":"Step inside the confession booth of Wesley Morris and Jenna Wortham, two culture writers for The New York Times. They devour TV, movies, art, music and the internet to find the things that move them — to tears, awe and anger. Still Processing is where they try to understand the pleasures and pathologies of America in 2018."},
{"Committed":"These are the hilarious, heartbreaking and inspiring stories of couples of all kinds who’ve soldiered through unimaginable circumstances, and after the longest of days, still want to wake up next to one another in the morning."},
{"Start With Why podcast":"My new podcast 'Under The Skin' asks: what's beneath the surface - of people we admire, of the ideas that define our time, of the history we are told. Speaking with guests from the world of academia, popular culture and the arts, they'll help us to see the ulterior truth behind our constructed reality. And have a laugh."},
{"The Way I Heard It with Mike Rowe":"All good stories have a twist, and all great storytellers are just a little twisted. Join Mike Rowe for a different take on the people and events that you thought you knew -- from pop-culture to politics from Hollywood to History... The Way I Heard It with Mike Rowe -- short mysteries for the curious mind with a short attention span."},
{"Crimetown":"Welcome to Crimetown, a new series from Gimlet Media and the creators of HBO's The Jinx. Every season, we'll investigate the culture of crime in a different American city. First up: Providence, Rhode Island, where organized crime and corruption infected every aspect of public life. This is a story of alliances and betrayals, of heists and stings, of crooked cops and honest mobsters—a story where it's hard to tell the good guys from the bad guys. Hosted by Marc Smerling and Zac Stuart-Pontier."},
{"Serial Killers":"Every Monday, Serial Killers takes a psychological and entertaining approach to provide a rare glimpse into the mind, methods and madness of the most notorious serial killers with the hopes of better understanding their psychological profile. With the help of voice actors, we delve deep into their lives and stories. Serial Killers is part of the Parcast Network and is a Cutler Media Production."},
{"Making Obama":"Former President Barack Obama — along with key advisers, mentors, and rivals — tells the story of his climb from Chicago to the national stage. Season One of Making told the story of how Oprah built a media empire. Now, the story of how Chicago shaped the country's first African-American president."},
{"Pick the Brain Podcast: Productivity | Motivation | Self Improvement | Health":"From the Self-Improvement Phenomenon blog PickTheBrain.com comes the Pick the Brain Podcast, the show where we pick the brains of the brightest minds in productivity, health, and self improvement. Pick the Brain has been named in over 100 “Best of the Web” lists, and Refinery29 named co-host Erin Falconer one of the Top 10 Women Changing the Digital Landscape for Good. Join hosts Erin Falconer and Jeremy Fisher as we retrain our brains to experience and expect the best from ourselves and the best from life."},
{"Anna Faris Is Unqualified":"Not-great-relationship advice from completely unqualified Hollywood types. I am a solid 3.4 student with a major in English from the University of Washington. I've also been asked what my SAT score was and it was 1060. It only took five years of dorm/rave life for me to accrue the life knowledge I have received. I’m a Sagittarius, which means I’m super creative and stubborn; but there are walls I need to break down because I always want to leap over the boundaries that make me climb ladders and roofs. I’m agreeable and delightful. I also have incredible leadership skills and following abilities. And, I have 20/20 vision so I’m an eagle eye. I could not love all of you more and please e-mail me at questions@annafarisisunqualified.com with your pressing relationship questions."},
{"The Habitat":"https://itunes.apple.com/us/podcast/the-habitat/id1369393780?mt=2"},
{"Stuff To Blow Your Mind":"Deep in the back of your mind, you’ve always had the feeling that there’s something strange about reality. There is. Join Robert and Joe as they examine neurological quandaries, cosmic mysteries, evolutionary marvels and our transhuman future on Stuff To Blow Your Mind, a podcast from HowStuffWorks.com."},
{"Septic":"Ashley White took a nap in 2015, leaving her children alone. When her 5-year-old son Noah is found dead in the family’s septic tank, the backlash was stronger than anyone could have imagined."},
{"The Good Place: The Podcast":"Holy motherforking shirtballs! This is the official podcast for NBC's The Good Place. We don't care how many points you have, subscribe and you'll get weekly behind-the-scenes stories, episode insights and anecdotes. Hosted by actor Marc Evan Jackson (Shawn) with a rotating slate of co-hosts and special guests, including actors, writers, producers and more, this podcast takes a deep dive into everything on- and off-screen.\n\nFollow: @nbcthegoodplace\nNBC Entertainment Podcast Network ©2018"},
{"Coffee Convos with Kail Lowry & Lindsie Chrisley":"Coffee Convos is hosted by Kail Lowry of MTV's Teen Mom and Lindsie Chrisley of USA Network's Chrisley Knows Best. These two reality stars come from totally different worlds, but have become close through their shared experiences as mothers, reality stars, and women. They share who they really are and talk about the issues they face every day. They don't always agree, but they love to have lively discussions about motherhood, friendship, television, family, and life in the public eye. Coffee Convos will feature all the latest in their busy lives, recommendations for other moms, and rants about trying to balance it all."},
{"The Rachel Maddow Show":"Rachel Maddow works with unmatched rigor and resolve to explain our complex world and deliver news in a way that's illuminating and dynamic, connecting the dots to make sense of complex issues. Join her every weeknight as she provides in-depth reporting to illuminate the current state of political affairs and reveals the importance of transparency and accountability from our leaders."},
{"StarTalk Radio":"Science meets comedy and pop culture on StarTalk Radio! Astrophysicist and Hayden Planetarium director Neil deGrasse Tyson, his comic co-hosts, guest celebrities and scientists discuss astronomy, physics, and everything else about life in the universe. But wait... there's more! Our new show, StarTalk All-Stars, features a revolving slate of all-star scientists and science educators including Bill Nye the Science Guy, backed up by your favorite comic co-hosts.\n\nCatch new episodes of StarTalk Radio on Fridays at 7pm ET, and StarTalk All-Stars on Tuesdays at 7pm ET. Keep Looking Up!"},
{"Sips, Suds, & Smokes":"Everything that is good in life is worth discussing. Lots of wine, whiskey, beer, and cigar talkin with a couple of good ol' boys."},
{"Amber on Podcasts":"Welcome to Amber on Podcasts:  The podcast that reviews podcasts! I used to be a totally different person, then I lost everything and pretty much thought I was going to die alone and broke. But then, I started listening to podcasts, and then more podcasts, and when those podcasts ran out I found new podcasts. Podcasts saved my life by giving me the tools to the answer the questions about my life’s vision, joy, and meaning. Podcasts are life-giving and this is where I’m going to tell you all about them. \n\nAlso, James Altucher is my hero, I love all things NPR (especially Kris Boyd), and Guy Raz is the dopest pod-host in the game. Booyakasha!"},
{"NPR News Now":"The latest news in five minutes. Updated hourly."},
{"The Goal Digger Podcast - Marketing, Social Media, Creative Entrepreneurship, Small Business Strategy and Branding":"How do I build my dream job? How do I make money online? Am I ready to leave my 9 to 5? How can I create passive income? How can I grow my Instagram following? And the biggest question of all, can I *really* turn my passion into profits? \n\nWelcome to the Goal Digger Podcast where we will answer ALL of these questions and so much more! Week after week, host Jenna Kutcher brings you the the productivity tips, social media strategies, business hacks,, and inspirational stories that can help YOU design your dream career. Jenna shares tangible tips and hacks that she used to become a self-made millionaire in photography, online courses, Instagram sponsorships, and navigating the world of being a #girlboss social media influencer. Along with sharing her best kept secrets, she interviews the best in the industry (Amy Porterfield, Jamie Ivey, Melyssa Griffin, Lori Harder, Cathy Heller and so much more) who will share their secrets to ensure you are seen, heard, (and hired!) \n\nWith millions of downloads and counting, the Goal Digger Movement is growing every day and now it’s YOUR TURN to hear from the experts, get inspired, and tackle your biggest goals along the way.  \n\nWhat do you say? Are you in?  Because we believe that work doesn’t have to feel like work. \n\nFor daily business tips, inspiration, (and free resources!):\n\nINSTAGRAM: @goaldiggerpodcast\n\nFACEBOOK: “Goal Digger Podcast Insiders”\n\nSHOWNOTES: www.goaldiggerpodcast.com"},
{"Stuff They Don't Want You To Know":"From UFOs to psychic powers and government conspiracies, history is riddled with unexplained events. You can turn back now or learn the Stuff They Don't Want You To Know, an audio podcast from HowStuffWorks.com."},
{"Reply All":"A podcast about the internet' that is actually an unfailingly original exploration of modern life and how to survive it. - The Guardian. Hosted by PJ Vogt and Alex Goldman, from Gimlet."},
{"Myths and Legends":"Jason Weiser tells stories from myths, legends, and folklore that have shaped cultures throughout history. Some, like the stories of Aladdin, King Arthur, and Hercules are stories you think you know, but with surprising origins. Others are stories you might not have heard, but really should. All the stories are sourced from world folklore, but retold for modern ears.\n\nThese are stories of wizards, knights, Vikings, dragons, princesses, and kings from the time when the world beyond the map was a dangerous and wonderful place."},
{"Modern Love":"Modern Love features top actors performing true stories of love, loss, and redemption. It has included performances by Kate Winslet, Uma Thurman, Angela Bassett, Jake Gyllenhaal, Sterling K. Brown, and more. A collaboration between WBUR and The New York Times."},
{"Jenna & Julien Podcast":"Welcome to the Jenna & Julien Podcast where we talk about all the things. If you are looking for your everyday, normal, by the book podcast, then you're in the wrong place. We created this because we tend to have awesome, random, and sometimes drunk conversations that we realized had to be shared with the lovely internet world."},
{"GONE":"Have you ever spent hours looking for something you simply lost? How about a hundred years? How about looking for a missing airplane? Or a vanished civilization? Every other Monday, Gone searches for everything lost. From D. B. Cooper to the Holy Grail, the Etruscan language to early Russian cosmonauts; if it disappeared, we’re looking. After all, just because something is gone, doesn’t mean it can’t be found. Gone is a production of Cutler Media and part of the Parcast Network."},
{"Ear Biscuits":"Join Rhett and Link, hosts of the popular daily YouTube show Good Mythical Morning and authors of the New York Times bestseller “Book of Mythicality” in a candid weekly conversation for your Internetainment."},
{"The Electorette Podcast":"The Electorette: A new podcast about politics, intersectionality and feminism. The Electorette features interviews and conversations with the women leading the resistance. They are passionate about equality, voting rights, climate change, access to healthcare & reproductive rights and all issues that make a healthy democracy."},
{"The Daily Show With Trevor Noah: Ears Edition":"Listen to highlights and extended interviews in the \"Ears Edition\" of The Daily Show with Trevor Noah. From Comedy Central’s Podcast Network."},
{"SHADES OF INTIMACY":"Join Jason and Jennie each week as they train, teach, tell and set the stage for people to experience their own growth within their relationships and families. Reaching the depths couples intuitively know is possible but have no clue how to get there is what they are committed too. Shades of Intimacy will give you the tools to start or continue your journey and continue to move forward in your relationship. It's time to get connected and build your tribe."},
{"Joel Osteen Podcast":"Welcome to the weekly audio Podcast from Joel Osteen.  Joel and Victoria Osteen are pastors of Lakewood Church in Houston, Texas, a vibrant and diverse church that Forbes calls the largest and fastest - growing congregation in America."},
{"Radiolab Presents: More Perfect":"Radiolab's More Perfect is a series about the Supreme Court. More Perfect explores how cases deliberated inside the rarefied world of the Supreme Court affect our lives far away from the bench."},
{"Thrivetime Show | Business School without the BS":"It's like Steve Martin meets Steve Forbes. - Jim Stovall - NY Times Best Selling Author. Experience business school without the BS with former US SBA Entrepreneur of the Year Clay Clark and the optometrist turned business tycoon Doctor Robert Zoellner. This award-winning team has been featured on Forbes, Fast Company, Bloomberg, Pando Daily, etc."},
{"Guys We F****d":"Welcome to GUYS WE F****D: THE ANTI SLUT-SHAMING PODCAST. They spread their legs, now they're spreading the word that women should be able to have sex with WHOEVER they want WHENEVER they want and not be ashamed or called sluts or whores. Welcome to a new revolution. Each week, Corinne Fisher & Krystyna Hutchinson (together known as the comedy duo Sorry About Last Night) interview a gentleman they slept with. Some they made love to, some they had sex with a few times and some they f****d in a hotel bathroom...er, what? Corinne & Krystyna want to make the world a more sex-positive place...one candid story of intercourse at a time."},
{"Embedded":"Host Kelly McEvers takes a story from the news and goes deep. Whether that means digging into the Trump administration's past, the stories behind police shootings caught on video, or visiting a town ravaged by the opioid epidemic, Embedded takes you where the news is happening."},
{"The School of Greatness with Lewis Howes":"Find out what makes the greatest people great and how to apply those lessons to your life. Join NYT bestselling author Lewis Howes as he shares inspiring stories from the most brilliant business minds, world class athletes and influential celebrities on the planet."},
{"Happier with Gretchen Rubin":"Gretchen Rubin is HAPPIER, and she wants you to be happier too. The #1 bestselling author of The Happiness Project and Better Than Before gets more personal than ever as she brings her practical, manageable advice about happiness and good habits to this lively, thought-provoking podcast. Gretchen’s cohost and guinea pig is her younger sister, Elizabeth Craft, a TV writer and producer living in Los Angeles, who (lovingly) refers to Gretchen as her happiness bully. Part of the Panoply Network."},
{"The Christopher Scott Show Talk Radio Podcast":"Common sense talk, news, politics, current events and personal development. In the age of continual constitutional crisis, fake news and partisan politics this show offers a refreshing common sense perspective. Regarded by many as one of the best podcasts by American talk show host, Christopher Scott."},
{"Death by Misadventure: True Paranormal Mystery":"Death by Misadventure, a new true paranormal mystery podcast. Each episode takes you on a supernatural journey and explores the most tragic deaths in celebrity history. We uncover the shocking details, reveal the mystical facts, and unravel the mystery behind rock stars and celebrities who died under infamous circumstances."},
{"She Says":"For the past year, reporter Sarah Delia has worked to unwrap the case of \"Linda,\" a Charlotte-area woman who was sexually assaulted by a stranger in 2015… and is still struggling to find answers. In a world full of #MeToo’s, justice might look as swift as one woman speaking up, but for many, resolution is a long and winding road. Follow the investigation at WFAE.org/SheSays."},
{"Welcome to Night Vale":"Twice-monthly community updates for the small desert town of Night Vale, where every conspiracy theory is true. Turn on your radio and hide. Never listened before? It's an ongoing radio show. Start with the current episode, and you'll catch on in no time. Or, go right to Episode 1 if you wanna binge-listen."},
{"The Church of What's Happening Now: With Joey Coco Diaz":"The Church Of What's Happening Now With: Joey Coco Diaz is a twice-weekly podcast hosted by Comedian Joey Coco Diaz along with his co-host Lee Syatt. Joey doesn't hold anything back and let's you know exactly what's on his mind. Joey and Lee are joined by one of Joey's friends, Comedians, Actors, Writers and Director's to name a few. We look forward to having you as a member of The Church."},
{"Bodega Boys":"Desus Nice (@Desusnice) and The Kid Mero (@thekidmero) are the Bodega Boys"},
{"Ear Hustle":"Ear Hustle brings you stories of life inside prison, shared and produced by those living it. The podcast is a partnership between Earlonne Woods and Antwan Williams, currently incarcerated at San Quentin State Prison, and Nigel Poor, a Bay Area artist. The team works in San Quentin’s media lab to produce stories that are sometimes difficult, often funny and always honest, offering a nuanced view of people living within the American prison system."},
{"Terrible, Thanks For Asking":"You know how every day someone asks how are you? And even if you’re totally dying inside, you just say fine, so everyone can go about their day? This show is the opposite of that. Hosted by author and notable widow (her words) Nora McInerny, this is a funny/sad/uncomfortable podcast about talking honestly about our pain, our awkwardness, and our humanness, which is not an actual word. From American Public Media."},
{"Why Is This Happening? with Chris Hayes":"Every week Chris Hayes asks the big questions that keep him up at night. How do we make sense of this unprecedented moment in world history? Why is this (all) happening? This podcast starts to answer these questions. Writers, experts, and thinkers who are also trying to get to the bottom of them join Chris to break it all down and help him get a better night’s rest. “Why is this Happening?” is presented by MSNBC and NBCNews Think."},
{"Conspiracy Theories":"The truth is rarely the best story. And when it’s not the only story, the truth deserves another look. Every Wednesday, we tell the complicated stories behind the world’s most controversial events and possible cover-ups. Conspiracy? Maybe. Coincidence? Maybe. Complicated? Absolutely. Conspiracy Theories is part of the Parcast Network and is a Cutler Media Production."},
{"Jason Zuk, The Social Psychic Radio Show and Blogcast":"Jason Zuk, an intuitive psychic medium since 2004, will cover a variety of topics associated with Spirituality, Mediumship, & Connecting to the Other Side."},
{"The Herd with Colin Cowherd":"The Herd with Colin Cowherd is a thought-provoking, opinionated, and topic-driven journey through the top sports stories of the day."},
{"Unleash Your Greatness Within":"Bestselling author TJ Hoisington shares success principles, insights on motivation and high achievement - helping you 'unleash your greatness within."},
{"Fantasy Throwdown Podcast":"Sports and fantasy sports collide as one man tries to cover everything under the sun or fall asleep trying."},
{"Rock N Roll Archaeology":"Rock And Roll Archaeology is, first and foremost, a community of Rock And Roll fans. Using our podcast, our website and blog, and of course, social media, we hope to provide a virtual town hall for Rock fans to meet and have great discussions about the history and impact of Rock And Roll. \n\nThe Music. The People. The Culture. The Technology. Any other topics or aspects that may come up. \n\nBring it. \n\nOur central question, our starting point is: How does Rock And Roll affect the larger society, and how does the larger society affect Rock And Roll?"},
{"Wow in the World":"Hosts Mindy Thomas and Guy Raz guide curious kids and their grown-ups on a journey into the wonders of the world around them. We'll go inside our brains, out into space and deep into the coolest new stories in science and technology."},
{"Breaking The Underdog Curse for Chiropractors":"Breaking “The Underdog Curse” is a show for vitalistic Chiropractors about breaking free from limiting beliefs, and how to overcome being stuck as an underdog. Your Host Dr. Don MacDonald is a Chiropractor, coach and the author of the bestselling book “The Underdog Curse”.  Hear Dr. Don's personal interviews with thought leaders, bestselling authors, and Chiropractors from around the world.   All designed to inspire you, challenge you and help you live more aligned with who you truly are."},
{"First Take":"First Take is always a heated discussion as Stephen A. Smith, Max Kellerman and guests debate about the day's top stories."},
{"Julio Caezar presents JuliTunzZz Radio":"Julio Caezar's JuliTunzZz Radio comes in as a bi-monthly dosage of the grooviest House TunzZz available, broadcasted across the globe. You'll get to chuckle at the interactions between Julio and his A.I. Rexie. Subscribe and let's groove! For free downloads, personal JuliBlogs & more: https://www.juliocaezar.com Social Media Platforms: @julitunzzz MGMT: juliocaezarmgnt@gmail.com Bookings: juliocaezarmgnt@gmail.com"},
{"Code Switch":"Ever find yourself in a conversation about race and identity where you just get...stuck? Code Switch can help. We're all journalists of color, and this isn't just the work we do. It's the lives we lead. Sometimes, we'll make you laugh. Other times, you'll get uncomfortable. But we'll always be unflinchingly honest and empathetic. Come mix it up with us."},
{"Global News Podcast":"Landmark study offers hope for women suffering from breast cancer / The cattle rustlers terrorising Nigerian communities"},
{"Couples Therapy with Candice and Casey":"You're used to seeing Casey Neistat share his own life through his popular YouTube video series. But now, listen to Casey and his wife Candice discuss candidly the ups and downs of their marriage, friendship, parenting, and lives in the YouTube spotlight."},
{"Motocross Supercross Podcast":"The Motocross Supercross Podcast is your number one destination for all things moto, MX, and SX. We will be releasing multiple episodes each week that will preview upcoming races along with a recap show for those races."},
{"#Viral with Natalie Alzate":"Join YouTube superstar and entrepreneur Natalie Alzate, aka Natalies Outlet, as she interviews established and emerging digital stars and dives deep into how they tackle success. From learning about their goals, approach, successes, failures and secrets to how they got to where they are, #Viral is a must listen for those who are curious and want to conquer the industry. New episodes drop every Friday!​"},
{"My Dad Wrote A Porno":"Imagine if your Dad wrote a dirty book. Most people would try to ignore it and pretend it had never happened - but not Jamie Morton. Instead, he's decided to read it to the world in this brand new comedy podcast. With the help of his friends, James Cooper and BBC Radio 1's Alice Levine, Jamie will be reading a chapter a week and discovering more about his father than he ever bargained for."},
{"H3 Podcast":"The official podcast of comedians Ethan & Hila Klein of h3h3productions"},
{"This Past Weekend":"https://itunes.apple.com/us/podcast/this-past-weekend/id1190981360?mt=2"},
{"NEXT 90 WITH NICK":"What happened this past weekend. And sometimes what happened on other days."},
{"ED MYLETT SHOW":"Delivering to you on the show great ideas, tactics, strategies and hopefully some inspiration that could help shape and transform areas of your life that you want to improve, whether that's your body, or your mind, your business or your family."},
{"Sleep With Me | The Podcast That Puts You To Sleep":"Insomnia? Mind racing at night? Worries keeping you up? Tune in for a bedtime story that lets you forget your problems and progressively gets more boring until you fall to sleep. So get in bed, press play, close your eyes, and drift off into dreamland."},
{"WARRIOR WEEK":"Every week co-hosts Garrett J White and Sam Falsafi share in a weekly discussion known as “Parables from the Pit” insights from Wake Up Warrior in what is known as Warrior Week exclusively for men.  Join them as they teach tools that have taken men down to the pits of hell within themselves in order to learn how to  let go and grow by liberating themselves."},
{"Family Ghosts":"Every house is haunted. In each episode of “Family Ghosts,” we'll investigate the true story behind a mysterious figure whose legend has followed a family for generations. Grandmothers who were secretly jewel smugglers, uncles who led double lives, siblings who vanished without a trace...these specters cast shadows over our lives in ways that might not be immediately obvious. But we are all formed in part by our familial collections of secrets, intrigues, and myths. By engaging with each others’ legends, perhaps we can see each others’ realities more clearly.\n\nHosted by Moth Grand Slam winner Sam Dingman, whose stories have been featured on Risk!, TBTL, Benjamen Walker's Theory of Everything, and The Moth Radio Hour."},
{"The Dollop with Dave Anthony and Gareth Reynolds":"Comedians Dave Anthony and Gareth Reynolds picks a subject from history and examine it."},
{"Elevation with Steven Furtick":"Welcome to the weekly podcast of Elevation Church led by Pastor Steven Furtick. To learn more visit our website at http://elevationchurch.org or download the Elevation App."},
{"Getting Curious with Jonathan Van Ness":"A weekly exploration of all the things Jonathan Van Ness (Queer Eye, Gay of Thrones) is curious about. Come on a journey with Jonathan and experts in their respective fields as they get curious about anything and everything under the sun."},
{"BiggerPockets Podcast : Real Estate Investing and Wealth Building to Help You Get Bigger Pockets":"Imagine you are friends with hundreds of real estate investors and entrepreneurs. Now imagine you can grab a beer with each of them and casually chat about failures, successes, motivations, and lessons learned. That’s what The BiggerPockets Podcast delivers.\n\nCo-hosted by BiggerPockets’ founder and CEO Joshua Dorkin and active real estate investor Brandon Turner, this podcast provides actionable advice from investors and other real estate professionals every week. The show won’t tell you how to “get rich quick” or sell you a course, boot camp, or guru system; instead, the BiggerPockets Podcast will give you real strategies that work for real people. Start listening and join the over 700k members who are learning to invest on BiggerPockets."},
{"The Lowe Post":"ESPN's Zach Lowe talks to various basketball people about various basketball things."},
{"Skip and Shannon: Undisputed":"The Skip and Shannon: Undisputed podcast. Skip Bayless, Shannon Sharpe, and Joy Taylor discuss the biggest topics of the day. It's unscripted and unfiltered. Don't miss the television show Monday-Friday at 9:30am ET on FS1."},
{"Thaddeus Ellenburg's Casual Friday":"Finish the work week in all-out hysterics with short stories written and read by Thaddeus Ellenburg. Released twice-monthly on Fridays."},
{"The Dennis Miller Option":"https://itunes.apple.com/us/podcast/the-dennis-miller-option/id1375147400?mt=2"},
{"Tumanbay":"A story of slaves, spies, armies, betrayals, assassinations, deserts and plagues set in set in a civilisation that might be from the distant past or the unknowable future. Each season is a continuous unfolding story."},
{"Your Mom's House with Christina P. and Tom Segura":"Christina Pazsitzky & Tom Segura are comedians who are also married. They are the Mommies and they welcome you to join them. Dental updates! Dudes! Stories! Wiping!"},
{"Unfake It Till You Make It":"This podcast is primarily an interview-based podcast that explores how to move from just surviving to truly thriving in the entertainment industry. The Host, Tony Suriano (Director/Actor) interviews professionals from all walks of the industry like film Producers, Cinematographers, Magicians, Actors, Directors, Managers, Audio Mixers, studio Musicians and many more creatives. Through stories of struggles and triumphs, he learns what it takes to make it in this cut-throat industry from those he looks up to. Please don't forget to subscribe and let us know what you liked best about the show by leaving a review!"},
{"Psychic Circus w/ Dr. Lars Dingman the Tunes Psychic":"Comedy Psychic: I'm funny and psychic both."},
{"DO THE WORK":"Welcome to the DO THE WORK podcast. Each week we will bring you the foundational principles needed to navigate through the obstacles and opportunities of life. We are vulnerable and raw in every episode. We never sugarcoat what it takes to take control of your life and live a life worth living. We share with you our successes and our defeats. We unpack how we have mastered prosperity in business and beyond. We share the lessons and stories of the journey we have been on and we demystify the journeys we are embarking on now. From business to personal, the DO THE WORK podcast covers it all. To learn more visit www.dothework.com"},
{"Cults":"Mystery. Manipulation. Murder. Cults are associated with all of these. But what really goes on inside a cult? More specifically, what goes on inside the minds of people who join cults and leaders who start them? Every Tuesday, Greg and Vanessa (co-hosts of the podcast Serial Killers) explore the history and psychology behind the most notorious cults. Cults is part of the Parcast Network and is a Cutler Media production. "},
{"Hungry Girl: Chew The Right Thing!":"Lisa Lillien (a.k.a. Hungry Girl) is a New York Times bestselling author and the creator of the Hungry Girl brand. She is the founder of hungry-girl.com (www.hungry-girl.com), the free daily email service that entertains and informs hungry people everywhere. A self-proclaimed mad scientist in the kitchen, Lisa dishes out healthy recipes (easy & delicious ones!), tips & tricks, supermarket finds, and survival guides for real-world eating situations. She considers herself a “foodologist,” not because she has some kind of fancy degree, but because she is obsessed with food –– how wonderful it is, and how much of it she can eat and still fit into her pants. Now, Lisa is taking her taste buds to the airwaves with her BRAND-NEW podcast... Hungry Girl: Chew The Right Thing!"},
{"Lovett or Leave It":"Jon Lovett, former Obama speechwriter and co-host of Pod Save America, is joined by comedians, actors, journalists, and many, many renowned Friends of the Pod for a roundup of the week's top news. Rants! Games! Bad impressions! Nuanced discussion! Recorded in front of a live audience."},
{"The Sam & Serg Show | WhatUp Silicon Valley | What Up | South Bay | StartUps | Entrepreneurs | Business Networking | Events |":"Hosts Sam Kabert & Sergio Oliveri cover all things Silicon Valley with a comedic twist (focus of Business News, Networking Events and Sports). Sam and Sergio met through the Silicon Valley Young Professionals (SVYP). Immediately a friendship was formed and since 2013 the two have been on the Executive Committee for SVYP. Expect to hear about the latest happenings on the WhatUp Silicon Valley weekly podcast. Make sure to Subscribe and leave a 5 star review if you feel we are worthy... and check out our website to get free SWAG! WhatUpSV.com"},
{"U Up?":"In this modern dating podcast presented by Betches Media, Jordana Abraham of Betches and Jared Freid discuss their take on modern dating issues ranging from apps to hook ups to relationships. What makes something a red flag versus a dealbreaker in the world we currently live in. They're here to help you not die alone."},
{"Transformation Church":"Here at Transformation Church we believe in Representing God to the lost and found for Transformation in Christ. We are a multi-ethnic, multi-generational, and multiplying church committed to progression not perfection."},
{"The Rod And Cyndee Spiritual Podcast":"Rod and Cyndee discuss some very unexpected spiritual topics, from past lives to spiritual magic. Join Rod and Cyndee as they plan their next adventure."},
{"Dan Carlin's Hardcore History: Addendum":"Interviews, musings and extra material from the makers of Dan Carlin's Hardcore History.  If it did not fit in the HH feed it's probably here"},
{"The MFCEO Project":"Do you really want to fulfill your own true potential? Learn how to build a real business with Andy Frisella on The MFCEO Project. Andy is an entrepreneur, CEO, author, and public speaker. He's built a $100+ million empire from nothing; and on the MFCEO Project he's going to show you how to do that, too. His podcast covers entrepreneur basics like money, marketing, and management. But Andy also takes your business to the next level with goal setting, productivity, the success mindset and more. Learn what it takes to truly live the 100-0 Lifestyle. Don't just learn to win. Let Andy teach you how to run the score up on your competition and dominate in your business."},
{"True Crime Garage":"Each week Nic and the Captain fire up the true crime garage flying ship fueled with beer, great discussion and listener participation. The garage covers a new case each week from headline news to local real life horror stories. Discussions about Serial killers like Ted Bundy, Jeffrey Dahmer and BTK, cold cases like Jonbenet Ramsy, OJ Simpson and the Zodiac, disappearances, missing persons and unsolved mysteries are all on tap along with craft beers from all over the world. If you like to kick back and have a little fun with your true crime than this show is for you and your friends. Remember don't take yourself too seriously because if you do, nobody else will. TrueCrimeGarage.com Find the full archive of True Crime Garage for free only on Stitcher, as well as exclusive bonus episodes of True Crime Garage: Off The Record, on Stitcher Premium. For a free month of listening, go to stitcherpremium.com/truecrimegarage and use promo code 'GARAGE'"},
{"Louder With Crowder":"Steven Crowder brings you news, entertainment and politics with the most politically incorrect show on the web. Guests, rants, sketches, your calls ... it's whatever."},
{"Reading With Your Kids Podcast":"Reading With Your Kids is all about encouraging parents to read with their kids, and cook with their kids, and do activities with their kids, and experience tv, movies and music together. In other words, our podcast is all about helping parents build stronger relationships with their kids."},
{"Missing & Murdered: Finding Cleo":"Where is Cleo? Taken by child welfare workers in the 1970’s and adopted in the U.S., the young Cree girl’s family believes she was raped and murdered while hitchhiking back home to Saskatchewan. CBC news investigative reporter Connie Walker joins the search to find out what really happened to Cleo."},
{"Small Doses":"Your favorite truth teller, comedian, Amanda Seales, is dropping gems with, “Small Doses,” a weekly podcast that brings you potent truths for everyday use."},
{"Freedom Empowered":"In today’s world there is an awkward connection between media, education and entertainment. Freedom empowered is here to revolutionize that balance. we have channeled a unique combination of fascinating success stories, out of the ordinary experiences, and innovative and common sense ideas alike to create a process to guide people on their journey towards personal freedom. Whether you envision yourself as the next big entrepreneur, the world’s most accomplished world traveler, or are simply looking for some grade A entertainment to start to let your mental sparks fly,  we have an episode for you."},
{"Accused":"Season 2: A soft-hearted prison minister was found killed in her Kentucky apartment, and Newport police zeroed in on an ex-convict she’d counseled. Thirty years later, the conviction is overturned and the case is once again unsolved. The Cincinnati Enquirer investigates: Was William Virgil wrongly convicted for murder?\n\nSeason 1: When Elizabeth Andes was found murdered in her Ohio apartment in 1978, police and prosecutors decided within hours it was an open-and-shut case. Two juries disagreed. The Cincinnati Enquirer investigates: Was the right guy charged, or did a killer walk free?"},
{"My Brother, My Brother And Me":"Free advice from three of the world's most qualified, most related experts: Justin, Travis and Griffin McElroy. For one-half to three-quarters of an hour every Monday, we tell people how to live their lives, because we're obviously doing such a great job of it so far."},
{"Stand Up Speak Up":"Discover the real-life stories of every day people surviving soul-crushing ordeals to take back their lives, becoming wiser, enlightened and triumphant in defying former tormentors and oppressors. Hear inspirational heroes speak honestly about their often-brutal experiences with Stand Up Speak Up to raise social awareness and remove stigmas. Listen to how the hurt, lost and forgotten overcome cruel adversity and go from victimized to victorious."},
{"Under the Scales":"https://itunes.apple.com/us/podcast/under-the-scales/id1163226019?mt=2"},
{"More Than Money":"More than Money is a podcast that creates a conversation community around how to use your values to engage with work and invest your wealth. The podcast is designed in a 12-episode season format. Each episode is produced around two core interview segments sharing a common theme. In this podcast, we explore the following topic areas: (1) business ethics, (2) economic justice, (3) corporate social responsibility, (4) social entrepreneurship, (5) community development, and (6) faith and values-based investing. Find us online at http://www.morethanmoney-podcast.com."},
{"Catfish and Cocaine Podcast":"Catfish and Cocaine is a weekly podcast hosted by a group of friends in Austin, TX. You'll get raw and unscripted/spontaneous conversation around sex, dating, careers and everything in between. Contact us at info@catfishandcocaine.net"},
{"Stay Tuned with Preet":"Join former U.S. Attorney Preet Bharara for a podcast about justice and fairness."},
{"Bad With Money With Gaby Dunn":"Join TV writer, actor, and New York Times best-selling author Gaby Dunn (aka America's Deadbeat Sweetheart) for season three of Bad With Money. After two seasons of reckoning with her own financial identity, Gaby's ready to give the American financial system an identity crisis. Every week, Gaby brings a queer, feminist, unabashedly radical point of view to conversations with celebrities, journalists, politicians, authors, activists, and fellow deadbeats. If you're sick of podcast \"experts\" giving you practical financial advice, you're going to love Bad With Money - the show that knows there's nothing practical about money, and isn't afraid to freak out about it."},
{"The Murder In My Family":"Murder is a crime of many victims. It affects not only the murdered, but also those who loved them. The Murder in My Family tells the effects of murder from the perspective of the family members of the victims and shows how they, too, are victims in this terrible crime."},
{"The Adventure Zone":"Justin, Travis and Griffin McElroy from My Brother, My Brother and Me have recruited their dad Clint for a campaign of high adventure. Join the McElroys as they find their fortune and slay an unconscionable number of ... you know, kobolds or whatever in ... The Adventure Zone."},
{"The Indicator from Planet Money":"A little show about big ideas. From the people who make Planet Money, The Indicator helps you make sense of what's happening today. It's a quick hit of insight into work, business, the economy, and everything else. Listen weekday afternoons."},
{"Spittin Chiclets":"Former NHL vets Ryan Whitney, Paul Bissonnette and Barstool Sports' Rear Admiral bring their outspoken and irreverent opinions to the masses. Focusing on the NHL but also touching on pop culture and everything else under the sun. New Episodes release every Tuesday and Friday."}]}




















